[
    {
        "title": "Main Page",
        "section": "Top Section",
        "content": "Genshin Impact (Chinese: 原神 Yuánshén) is a free-to-play action RPG developed and published by miHoYo. The game features a fantasy open-world environment and action based combat system using elemental magic, character switching, and gacha monetization system for players to obtain new characters, weapons, and other resources. The game can only be played with an internet connection and features a limited multiplayer mode allowing up to four players in a world. The game was released worldwide on September 28, 2020, for PC, iOS/Android, and PlayStation 4. A PlayStation 5 version was released on November 11, 2020, which features cross-save support with the PlayStation 4. A second PC version released on the Epic Games Store on June 9, 2021. The game is also planned to release on the Nintendo Switch."
        },
    {
        "title": "Main Page",
        "section": "Gameplay",
        "content": "Players explore the game's large fantasy world, called Teyvat, with over 40 characters and various points of interest spread across the map. The game features an action combat playstyle that allows the player to swap between 4 individual characters in a party to quickly combo attacks. Single-player gameplay is the focus of the game, with Co-Op Mode available for certain activities. Each character has two unique combat skills: an Elemental Skill and an Elemental Burst. The Elemental Skill can be used at any time except for the cooldown period immediately after use, while the Elemental Burst has an Energy Cost, requiring the user to amass sufficient Energy first. Characters have control over one of seven natural elements: Cryo, Dendro, Pyro, Hydro, Anemo, Electro, and Geo. Combining these elements using Elemental Reactions is encouraged to quickly defeat enemies. Cooking and crafting are other significant aspects of Genshin Impact's gameplay. Players gather many resources in the course of their adventure, some of which can be turned into dishes via cooking, and potions and ascension materials via crafting. Dishes can regenerate characters' health, boost attack or defensive abilities, and decrease stamina consumption, while potions can increase a character's resistance against or damage for an element. Further progression in the game unlocks the Housing system, known as the Serenitea Pot, in which players can create furnishings and place them in a realm layout, gaining access to rewards and level-up materials. The Fishing system allows players to catch fish, which can be displayed in the Serenitea Pot or exchanged at each nation's Fishing Association for rewards."
    },
    {
        "title": "Main Page",
        "section": "Story - Setting",
        "content": "The story of Genshin Impact takes place in the world of Teyvat which is home to seven major nations: Mondstadt, Liyue, Inazuma, Sumeru, Fontaine, Natlan, and Snezhnaya. These nations are ruled over by deities known as Archons, part of a group of gods called The Seven. Each Archon is associated with one of the seven elements of Teyvat, and is also reflected in their nation's landscape and culture. For example, the nation of Mondstadt is ruled over by Barbatos the Anemo Archon, and so the element of wind is an important symbol known by its people. Apart from the seven nations, there was the nation of Khaenri'ah that lived independently from the authority of gods. Celestia is the main heavenly body that presides over Teyvat and is in direct connection with The Seven. A floating island seen in the sky is believed to be it, allegedly the home to gods and also mortals who have ascended to godhood. Humans that are granted Visions, magical gems that grant bearers the ability to command elemental power, are called \"allogenes\" — ones with the potential to reach godhood. While gods rule, the nations also have their own human governing bodies: the Knights of Favonius to Mondstadt, the Qixing to Liyue, and the Shogunate to Inazuma."
    },
    {
        "title": "Main Page",
        "section": "Story - Plot",
        "content": "A pair of \"star traveler\" twins who visit different worlds arrive in the world of Teyvat and witness the destruction of the nation of Khaenri'ah. While attempting to flee, an unnamed god blocks their path and separates them: she captures one and seals away the power of the other. The sealed twin (known as the \"Traveler\") awakens five hundred years later and meets Paimon, who becomes their companion. For months they travel together and then make their way to Mondstadt. There, they begin the search for the Traveler's missing sibling."
    },
    {
        "title": "Main Page",
        "section": "Story - Characters",
        "content": "As Paimon and the Traveler are on their way to Mondstadt, they meet Amber of the Knights of Favonius — she had been scouting monster camps nearby. After brief questioning, she offers to escort the duo to the city after completing her tasks. Later, a dragon dubbed \"Stormterror\" attacks Mondstadt, and the Traveler gets caught by one of his whirlwinds. The Traveler manages to fend off the dragon and catches the attention of the Knights of Favonius. They become acquainted with other members: Acting Grand Master Jean, Cavalry Captain Kaeya, and resident librarian Lisa. (Amber, Kaeya, and Lisa are the three free playable characters the player would obtain in the game.) The Traveler agrees to help the Knights resolve the ongoing crisis and gains more allies: Venti, a local bard who wants to help the dragon, and wine tycoon Diluc."
    },
    {
        "title": "Main Page",
        "section": "Development",
        "content": "Genshin Impact was announced in June 2019 at E3 2019. Mihoyo sought to create a game that was distinct from Honkai Impact 3rd in terms of its quest and combat systems as well as its random events and mode of exploration. Genshin Impact was designed as a cross platform title, developing the game on PC and PlayStation platforms allowed the developers to raise graphical fidelity for the game, such rendering realistic shadows. It was developed using Unity engine (2017.4.30.0). The Legend of Zelda: Breath of the Wild is held in high regard by the development team, and is cited as one of the main inspirations for Genshin Impact. The game had a development and marketing budget of around $100 million. The game was released for Microsoft Windows, PlayStation 4, Android, and iOS on September 28, 2020, and features cross-platform play between them. The game was released on PlayStation 5 on November 11, 2020, improving graphics and loading times over the PlayStation 4 version. The PlayStation 5 version of Genshin Impact was officially released on April 28, 2021. The game will also be released for Nintendo Switch, but no release date has been announced. Genshin Impact was made available on the Epic Games Store for Windows users on June 9, 2021."
    },
    {
        "title": "Main Page",
        "section": "Trivia",
        "content": "The main menu screen and soundtrack changes based on the time of day and the sunrise/sunset times for the user's location, which is inferred through the user's IP address. The term \"Genshin\" has not been used in the English localization apart from its title. In the East Asian languages, the title of the game was used for the term Allogene, which refers to a Vision bearer who has the potential to become a god. Unlike its sister game, Honkai Impact 3rd, Genshin features a full English voice cast for all the playable characters and also most NPCs. The game draws heavy inspiration from The Legend of Zelda: Breath of the Wild, from Domains to certain weapons and enemies to stamina and puzzles."
    }
]